In [1]:
import pandas as pd
import numpy as np

In [3]:
datafashion = pd.read_csv('dress.csv')

In [5]:
datafashion.dtypes

_unit_id                 int64
category                object
category:confidence    float64
image_url               object
dtype: object

In [6]:
datafashion

,_unit_id,category,category:confidence,image_url
0,851505458,ikat,0.3487,http://s3-eu-west-1.amazonaws.com/we-attribute...
1,851505459,plain,1.0000,http://s3-eu-west-1.amazonaws.com/we-attribute...
2,851505460,polka dot,0.6709,http://s3-eu-west-1.amazonaws.com/we-attribute...
3,851505461,plain,1.0000,http://s3-eu-west-1.amazonaws.com/we-attribute...
4,851505462,geometry,0.7035,http://s3-eu-west-1.amazonaws.com/we-attribute...
...,...,...,...,...
15697,854497210,plain,1.0000,http://s3-eu-west-1.amazonaws.com/we-attribute...
15698,854497281,floral,1.0000,http://s3-eu-west-1.amazonaws.com/we-attribute...
15699,854497512,squares,0.9230,http://s3-eu-west-1.amazonaws.com/we-attribute...
15700,854497595,tribal,0.5199,http://s3-eu-west-1.amazonaws.com/we-attribute...
15701,856388654,polka dot,0.9618,http://s3-eu-west-1.amazonaws.com/we-attribute...

## Menampilkan Isi Distionary Dengan Tipe Objek

In [7]:
jumlahrecord = len(datafashion)
namaattribut = datafashion.columns
jumlahattribut = len(datafashion.select_dtypes(include=['object']).columns)

dictobjt = {
    'jumlah record': jumlahrecord,
    'nama attribut' : namaattribut,
    'jumlah attribut' : jumlahattribut,
}
pd.Series(dictobjt)

jumlah record                                                  15702
nama attribut      Index(['_unit_id', 'category', 'category:confi...
jumlah attribut                                                    2
dtype: object

## Menampilkan Isi dari Dictionary Dengan Tipe Angka

In [8]:
jumlahattribut = len(datafashion.select_dtypes(include=['int64']).columns)
jumlahNULL = len(datafashion.columns[datafashion.isna().sum() > 0])
dictint = {
    'jumlah attribut' : jumlahattribut,
    'jumlah attribut NULL' : jumlahNULL,
}
pd.Series(dictint)

jumlah attribut         1
jumlah attribut NULL    0
dtype: int64

## Menampilkan Nilai Rata-Rata(Mean)

In [9]:
datafashion.select_dtypes(include=['int64']).mean()

_unit_id    8.515145e+08
dtype: float64

## Menampilkan Nilai Standar Deviasi

In [10]:
datafashion.select_dtypes(include=['int64']).std()

_unit_id    61669.867668
dtype: float64

## Menampilkan Nilai Minimum

In [11]:
datafashion.select_dtypes(include=['int64']).min()

_unit_id    851505458
dtype: int64

## Menampilkan Nilai Maksimum

In [12]:
datafashion.select_dtypes(include=['int64']).max()

_unit_id    856388654
dtype: int64

## Menampilkan Nilai Q1, Q2, Q3

In [14]:
datafashion.select_dtypes(include=['int64']).quantile([0.25, 0.50, 0.75])

          _unit_id
0.25  8.515094e+08
0.50  8.515134e+08
0.75  8.515175e+08

## Menampilkan Nilai Mean, Standar Deviasi, MIN, MAX, Q1,Q2,Q3

In [15]:
datafashion.describe()

           _unit_id  category:confidence
count  1.570200e+04         15702.000000
mean   8.515145e+08             0.856637
std    6.166987e+04             0.216946
min    8.515055e+08             0.253800
25%    8.515094e+08             0.674500
50%    8.515134e+08             1.000000
75%    8.515175e+08             1.000000
max    8.563887e+08             1.000000

## Menampilkan Nilai Korelasi

In [16]:
datafashion.select_dtypes(include=['int64']).corr()

          _unit_id
_unit_id       1.0

## Mengubah Nilai

In [17]:
datafashion["_unit_id"] = datafashion["_unit_id"].astype('float64', errors='ignore')
datafashion["_unit_id"].dtypes

dtype('float64')

## Menampilkan Setelah Nilai Diubah

In [18]:
pd.options.display.float_format = '{:.3f}'.format
datafashion._unit_id.astype('float64')

0       851505458.000
1       851505459.000
2       851505460.000
3       851505461.000
4       851505462.000
             ...
15697   854497210.000
15698   854497281.000
15699   854497512.000
15700   854497595.000
15701   856388654.000
Name: _unit_id, Length: 15702, dtype: float64

## Menampilkan 10 Record Pertama

In [19]:
datafashion.select_dtypes(include=['int64']).head(10)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

## Menyimpan Dataset Dengan attribute Bertipe Angka ke dalam file CSV.

In [25]:
datafashion.select_dtypes(include=['int64']).to_csv("Attribut_Bertipe_Fashion_Dataset.csv", index=False)